index.org
#+TITLE: 425
#+OPTIONS: toc:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css" />
#+HTML_HEAD: <style>div.figure img {max-height:300px;max-width:900px;}</style>
#+HTML_HEAD_EXTRA: <style>.org-src-container {background-color: #303030; color: #e5e5e5;}</style>

* Семинары
** <2019-11-06 Wed> [[file:./2019_11_06.org][tmux, emacs, org-mode, dat, git]]
** <2019-11-07 Thu> [[file:src/seminars/2019_11_07.org][=$PATH= и окружение]]

* Чем мы пользуемся на семинарах
  На семинарах мы сидим в [[https://nixos.org/][NixOS]] на [[https://github.com/sem425/nixconfig][этом конфиге]]. Участники семинара
  часть работы выполняют на своих машинах, а часть на удаленном
  сервере (виртуалке) через [[https://en.wikipedia.org/wiki/Secure_Shell][ssh]] в мультиплексере [[https://github.com/tmux/tmux/wiki][tmux]]. Тексты этого
  семинара вместе с кодами стараемся писать в [[https://www.gnu.org/software/emacs/][emacs]]. Коллаборативную
  разработку на больших отрезках времени ведем в связке [[https://git-scm.com/][git]] +
  [[https://github.com/][github.com]]. Коллаборативную разработку на малых отрезках времени
  ведем в =tmux= на сервере с синхронизацией текущего содержимого
  файликов по протоколу [[https://dat.foundation/][dat]] на локальные машины участников семинара.
  Графические скетчи мы пишем на =js=, используя [[https://p5js.org/examples/simulate-flocking.html][p5js]]. [[https://codesandbox.io/s/modern-bird-368wk][Тут]] пример нашего скетча на
  [[https://codesandbox.io][codesandbox.io]]. /Очень хотим вставлять скетчи прямо в этот текст./

**** TODO Привести тут список семинарских инструкций по каждому инструменту
     :PROPERTIES:
     :UNNUMBERED: notoc
     :END:

* Планы
** Инструменты
   - [ ] [[https://git-scm.com/][git]]
   - [ ] [[https://en.wikipedia.org/wiki/Secure_Shell][ssh]] + [[https://en.wikipedia.org/wiki/SOCKS][SOCKS]] туннели
   - [ ] [[https://www.gnu.org/software/emacs/][emacs]] + [[https://orgmode.org/][org mode]]
   - [ ] [[https://en.wikipedia.org/wiki/Rsync][rsync]]
   - [ ] [[https://syncthing.net/][syncthing]]
   - [ ] [[https://openvpn.net/][openvpn]]
   - [ ] [[https://dat.foundation/][dat]] + браузер [[https://beakerbrowser.com/][Beaker]]

** Системное программирование
   - [ ] stack and heap в программах на C
   - [ ] Отладчик gdb
   - [ ] Указатели и адресная арифметика
   - [ ] Основы ассемблера + понимание того, как реализована концепция
     функции в языке C в железе
   - [ ] Работа с динамической памятью
   - [ ] Работа с файлами
   - [ ] Межпроцессное взаимодействие, сокеты, tcp, udp
   - [ ] Многопоточность
   - [ ] Работа с памятью в языках со встроенным сборщиком мусора

** Art programming
   - [ ] Основы графики на =js=
   - [ ] Разбор художественных произведений + быстрое чтение и
     понимание кода
   - [ ] Работа со звуком. Live coding
   - [ ] Интеграция математических понятий в визуальный контекст

*** Предлагаю кодить разные математические концепции 
    И учиться думать о них. Например сделать анимацию градиентного спуска, решить задачу n-body,
    симулировать дым и огонь, визуализировать фазовое пространство
    нескольких дифференциальных уравнений. Основная идея - это
    применение математических концепций в вашем творчестве.

** Алгоритмы
   А где вы будете применять алгоритмы? Сперва надо набить шишки в
   творческом поиске, получить медленные, но интересные программы, а
   потом применить алгоритмы!

* Литература
  - Командная строка Linux. Полное руководство. Уильям Шоттс.
    ISBN: 978-5-496-02303-0
  - Туториал внутри самого emacs: =C-u-h t= (есть перевод на русский)
  - [[http://ergoemacs.org/emacs/emacs.html][Practical Emacs Tutorial]]
  - [[https://www.youtube.com/user/mzamansky/videos][Emacs episodes by Mike Zamansky]]
  - [[https://git-scm.com/book/ru/v2][Git book. Scott Chacon & Ben Straub]]
  - [[https://thebookofshaders.com/][The Book of Shaders]] by Patricio Gonzalez Vivo and Jen Lowe
  - [[https://nixos.org/~eelco/pubs/phd-thesis.pdf][The Purely Functional Software Deployment Model]] by Eelco Dolstra

* Расписание
  Семинары проходят по средам и четвергам в 3-ем корпусе в 425-ой
  комнате. Начало семинара в 18:30.
