index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>425</title>
<!-- 2019-11-16 Sat 23:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content">
<h1 class="title">425</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Семинары</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-06 Wed&gt;</span></span> <a href="./2019_11_06.html">tmux, emacs, org-mode, dat, git</a></h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-07 Thu&gt;</span></span> <a href="src/seminars/2019_11_07.html"><code>$PATH</code> и окружение</a></h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Чем мы пользуемся на семинарах</h2>
<div class="outline-text-2" id="text-2">
<p>
На семинарах мы сидим в <a href="https://nixos.org/">NixOS</a> на <a href="https://github.com/sem425/nixconfig">этом конфиге</a>. Участники семинара
часть работы выполняют на своих машинах, а часть на удаленном
сервере (виртуалке) через <a href="https://en.wikipedia.org/wiki/Secure_Shell">ssh</a> в мультиплексере <a href="https://github.com/tmux/tmux/wiki">tmux</a>. Тексты этого
семинара вместе с кодами стараемся писать в <a href="https://www.gnu.org/software/emacs/">emacs</a>. Коллаборативную
разработку на больших отрезках времени ведем в связке <a href="https://git-scm.com/">git</a> +
<a href="https://github.com/">github.com</a>. Коллаборативную разработку на малых отрезках времени
ведем в <code>tmux</code> на сервере с синхронизацией текущего содержимого
файликов по протоколу <a href="https://dat.foundation/">dat</a> на локальные машины участников семинара.
Графические скетчи мы пишем на <code>js</code>, используя <a href="https://p5js.org/examples/simulate-flocking.html">p5js</a>. <a href="https://codesandbox.io/s/modern-bird-368wk">Тут</a> пример нашего скетча на
<a href="https://codesandbox.io">codesandbox.io</a>. <i>Очень хотим вставлять скетчи прямо в этот текст.</i>
</p>
</div>

<ol class="org-ol"><li><a id="sec-2-0-0-1" name="sec-2-0-0-1"></a><span class="todo TODO">TODO</span> Привести тут список семинарских инструкций по каждому инструменту<br  /><div class="outline-text-5" id="text-2-0-0-1">
</div>
</li></ol>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Планы</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Инструменты</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="https://git-scm.com/">git</a>
</li>
<li><code>[&#xa0;]</code> <a href="https://en.wikipedia.org/wiki/Secure_Shell">ssh</a> + <a href="https://en.wikipedia.org/wiki/SOCKS">SOCKS</a> туннели
</li>
<li><code>[&#xa0;]</code> <a href="https://www.gnu.org/software/emacs/">emacs</a> + <a href="https://orgmode.org/">org mode</a>
</li>
<li><code>[&#xa0;]</code> <a href="https://en.wikipedia.org/wiki/Rsync">rsync</a>
</li>
<li><code>[&#xa0;]</code> <a href="https://syncthing.net/">syncthing</a>
</li>
<li><code>[&#xa0;]</code> <a href="https://openvpn.net/">openvpn</a>
</li>
<li><code>[&#xa0;]</code> <a href="https://dat.foundation/">dat</a> + браузер <a href="https://beakerbrowser.com/">Beaker</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Системное программирование</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> stack and heap в программах на C
</li>
<li><code>[&#xa0;]</code> Отладчик gdb
</li>
<li><code>[&#xa0;]</code> Указатели и адресная арифметика
</li>
<li><code>[&#xa0;]</code> Основы ассемблера + понимание того, как реализована концепция
функции в языке C в железе
</li>
<li><code>[&#xa0;]</code> Работа с динамической памятью
</li>
<li><code>[&#xa0;]</code> Работа с файлами
</li>
<li><code>[&#xa0;]</code> Межпроцессное взаимодействие, сокеты, tcp, udp
</li>
<li><code>[&#xa0;]</code> Многопоточность
</li>
<li><code>[&#xa0;]</code> Работа с памятью в языках со встроенным сборщиком мусора
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Art programming</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Основы графики на <code>js</code>
</li>
<li><code>[&#xa0;]</code> Разбор художественных произведений + быстрое чтение и
понимание кода
</li>
<li><code>[&#xa0;]</code> Работа со звуком. Live coding
</li>
<li><code>[&#xa0;]</code> Интеграция математических понятий в визуальный контекст
</li>
</ul>
</div>

<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Предлагаю кодить разные математические концепции</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
И учиться думать о них. Например сделать анимацию градиентного спуска, решить задачу n-body,
симулировать дым и огонь, визуализировать фазовое пространство
нескольких дифференциальных уравнений. Основная идея - это
применение математических концепций в вашем творчестве.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Алгоритмы</h3>
<div class="outline-text-3" id="text-3-4">
<p>
А где вы будете применять алгоритмы? Сперва надо набить шишки в
творческом поиске, получить медленные, но интересные программы, а
потом применить алгоритмы!
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Литература</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Командная строка Linux. Полное руководство. Уильям Шоттс.
ISBN: 978-5-496-02303-0
</li>
<li>Туториал внутри самого emacs: <code>C-u-h t</code> (есть перевод на русский)
</li>
<li><a href="http://ergoemacs.org/emacs/emacs.html">Practical Emacs Tutorial</a>
</li>
<li><a href="https://www.youtube.com/user/mzamansky/videos">Emacs episodes by Mike Zamansky</a>
</li>
<li><a href="https://git-scm.com/book/ru/v2">Git book. Scott Chacon &amp; Ben Straub</a>
</li>
<li><a href="https://thebookofshaders.com/">The Book of Shaders</a> by Patricio Gonzalez Vivo and Jen Lowe
</li>
<li><a href="https://nixos.org/~eelco/pubs/phd-thesis.pdf">The Purely Functional Software Deployment Model</a> by Eelco Dolstra
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Расписание</h2>
<div class="outline-text-2" id="text-5">
<p>
Семинары проходят по средам и четвергам в 3-ем корпусе в 425-ой
комнате. Начало семинара в 18:30.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-11-16 Sat 23:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
